{
    "title": "Business Analyst (BA)",
    "description": "As a Business Analyst, you will work closely with Product, Technology and Operation team. This position is expected to lead a team of 2 - 3 in next 6 - 9 months. \n\nDescription of Job: \n\n- Quickly understands the business issues and data challenges of the organization and industry.\n- To collect business requirements from product team, operation team or end users.\n- Reviews and edits requirements, specifications, business processes and recommendations related to proposed solution.\n- Develops functional specifications, wireframes and system design specifications.\n- Manage and elaborate requirements into user stories and acceptance criteria.\n- Integrate usability studies, research, and market analysis into detailed analysis and reports.\n- Analyze requirements and draw wireframes with UX experience.\n- Create wireframes to effectively communicate interaction and design ideas.\n- Develop metrics and reports that can be used to drive data driven decisions.\n- Stay tuned with design trends, technologies, and best practices.\n",
    "requirements": "Bachelor degree in IT or related field.\nAt least 1 years experience in BA role on internet/consumer products, not B2B.\nExperience working in the internet-product company.\nKnowledge of software development process, especially software requirement analysis.\nExcellent in both Vietnamese & English communications skills (speaking, listening, reading and writing). Must be able to communicate effectively and confidently with users, team members, and management.\nVery strong analytical and product management skills required, including a thorough understanding of how to interpret customer business needs and translate them into the application and operational requirements.\nAble to produce wireframes and specs related.\nComfortable in a small, intense and high-growth startup environment. \nFlexible schedule but require working with the remote team in the USA in evenings\nPersonal integrity, able to work to deadlines and under pressure.",
    "required_skills": [
        "wireframes",
        "product management",
        "management",
        "analysis",
        "process development",
        "software development",
        "communication skill",
        "internet"
    ]
}